{
  "categories" : [ {
    "name" : "Movies",
    "videos" : [ {
      "description" : "The best chest exercises are not determined by the ones you can lift the most weight on but rather the ones that work best for you.  In this video, I’m going to show you the 8 best chest exercises to help you build a bigger chest despite using bench press and dips for years.  Many people think that these staple chest workout moves must be included if you want to develop a big chest, but the reality is they do not work best for everyone.

That said, the eight chest exercises shown here are ones you can try if you feel like you have hit a dead end in your chest development.  Beyond that, these can be done as activators before your chest workout that will help you to get even more out of the bench press and dips later in the routine.  The key is first to understand why these two big exercises may not be working so great for you.

It comes down to the anatomy of the chest and how it prefers to contract.  The biggest motion that the pecs are responsible for above all others is horizontal adduction at the shoulder.  This means, taking the upper arm and driving it across the chest.  Ideally, you would want your chest exercises to incorporate the motion so that both arms could almost cross over each other or at least the midline of your body if you want to get a maximal chest contraction.

We can do that with the first exercise shown, the twisting pushup.  Here, no equipment at all is needed to help you get more from your pushups.  Instead of just pushing straight up and down you can twist your body as you do and get a relative adduction at the shoulder which will help you get a better squeeze and contraction.  Since your hands will be fixed on the ground as they are in a regular pushup, the twisting of the body will draw the arm across and help you get better results from doing this.

The plate squeeze is an awesome chest exercise that can be used as an activator before your chest workout or at the end as a finisher.  The key is to squeeze the plates as hard as possible together and not let them slide apart.  The chest contraction you feel here will be insane and well worth the inclusion of this move in your chest workout.

The Db chest pullover is a variation of the classic dumbbell pullover, except this one will target the upper pecs as opposed to the lats.  Instead of flaring the elbows and trying to pull the weight all the way up over your chest, restrict the range of motion a bit and squeeze the hands together to get the weight up.  This will light up your upper pecs and really help you to recruit this often hard to hit area much better.

Floor flys give you a safer way to overload this common chest exercise.  The problem with the traditional fly exercise is that it places your shoulder joints in a compromising position.  Some will say to just drop the amount of weight you use here and you will have no problems.  The issue is, you will be leaving gains on the table by doing that.  Here you can get the best of all worlds while having the floor to support your use of heavier, muscle building weights.

The variations of chest crossovers give you an obvious way to get not just one arm, but both, across your body and experience a strong chest contraction.  Whether you do the 3D cross over or the X cross, both of these are going to help you to get great chest activation and even better chest growth over time.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%208%20Best%20Chest%20Exercises%20(NO%20BENCH%20OR%20DIPS!).mp4?alt=media&token=547973ae-9230-4f01-934d-c4aa42178b7a" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailchest.jpg?alt=media&token=fa6a4f50-ba67-417f-9374-ced7fcfef6cf",
      "title" : "The 8 Best Chest Exercises (No bench or dips!)"
    }, {
      "description" : "The perfect chest workout should consist of exercises for your upper chest, middle chest and lower chest.  That said, even that doesn’t make the chest workout complete.  In order to round out your pecs with a well rounded workout you need to fill in the gaps of what is lacking on those popular chest exercises.  That is what we do in this video.

If you look at the four main exercises that people do in their chest workouts you will see incline bench press, barbell bench press, dips and pushups.  Take a close look into each of these classic movements and you will see one thing in common.  That is, each of these exercises is lacking a full adduction of the shoulder within the exercise.

This is a problem when it comes to developing a complete chest.  Just because you are going through a full range of motion on the exercises that you are doing it does not mean that you are taking a muscle through its full range of motion.  For instance, all chest exercises are performed by changing the angle of the arm at the shoulder.  Because the shoulder is a three dimensional ball and socket joint, you have a great deal of motion available to you on your chest exercises.

That said, with the hands being fixed on a barbell, dip station or the floor through most of the common chest exercises you are not able to take your shoulder through the full horizontal adduction that it is capable of going through.  Due to this, there is limited activation of the pecs since they are built to take the arm fully across the body, over midline into a more complete adduction.

The solution to this problem is to not forego the popular mass building chest exercises but add to them, in drop set fashion.  Here is how to construct the perfect chest workout with that in mind.

Barbell Bench Press - 4 sets of 6,8,10,12 reps
Immediately into a horizontal chest cable or band crossover for 15 reps

Incline DB Bench Press - 4 sets of 6,8,10,12 reps
Immediately into a low to high cable or band crossover for 15 reps

Weighted Dips - 4 sets of 6,8,10,12 reps
Immediately into a high to low cable or band crossover for 15 reps

Weighted Pushups - 3 sets to Failure
Immediately into a banded crossover pushup for 15 reps with band on each arm

When you put this together in drop set format as I’m suggesting here, you not only now hit the chest through it’s full range of motion but you hit every area of the chest as well.  The drop down allows for the lesser intense exercise to be more taxing since it was just preceded by a more difficult compound lift.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20PERFECT%20Chest%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=85dbdc12-26c8-43b3-9aff-fa4685b63f55" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailchest11.jpg?alt=media&token=6c6ab2e3-0022-4515-ad9d-548e86dd2468",
      "title" : "The PERFECT Chest Workout (Sets and Reps Included)"
    }, {
      "description" : "If you want to develop the middle chest or the inner chest to get more defined pecs, you need to watch this video. Here I’m going to show you the only way you can effectively improve the visual appearance of this portion of the chest muscle. Here’s a spoiler, you cannot directly improve only this portion of the pecs but because of the contrast this area provides, you can get it to start looking better quickly if you do the right things.

First thing again that you need to realize is that the inner chest or middle chest is not something you can directly hypertrophy. This is simply the attachment point or the origin of the pec major muscle. As with all muscular attachments however, we are talking about a tendon connecting to a bone (in this case the sternum) at this inner most portion of the pectoralis major. 

As we know, tendons are not capable of the hypertrophy that a muscle is. At the point of attachment, the muscle is going to be essentially sutured down to the bone and stay close to that point even as the muscle itself starts to grow. It is the visual differential in depth that is created as the muscle starts to grow away from the ribcage that gives the deepening effect of the middle chest.

This means, if you want to get your middle chest to look more defined and better overall, you are going to have to grow the entire chest muscle.

That said, as with any muscle that you are seeking to improve the way it looks you should always start with looking at your diet. If you have too high body fat levels you are never going to get the chest to look as ripped and muscular as you would like. Higher body fat levels tend to accumulate in chest fat for men making even a larger chest look less desirable than one that is smaller but more lean.

Beyond the chest anatomy however is the way you train it and the type of chest workouts and chest exercises you perform.

One of the most important things you can do if you want to build a bigger chest is remember to not just focus on strength building exercises. Some of the most classic chest strength exercises like the bench press, incline bench press, weighted dips and weighted pushups are all lacking one very important element - chest adduction capability. Because your hands are in a fixed position on every one of those chest exercises you are not able to bring them close together or across midline to get a complete chest contraction.

When you are trying to build the inner chest or any portion of your chest really, you have to make sure you don’t forget to include some exercises that allow your hands the freedom of motion to do this. That said, take an exercise like the cable crossover. Even if you perform this regularly in your chest workouts but stop your arm as soon as it gets to the point of your midline you won’t get the type of results you would if you brought it all the way across your midline.

When looking to build your chest you have to remember to take it to a point of a complete pec contraction.

Now of course you will visually see the improvement of the inner chest appearance just by getting into this position. Don’t be confused. This is just the shortening of the muscle due to this increased contraction that makes it stand out more. However, the repeated repetitions that you will accumulate by doing this the right way on your chest exercises will allow the overall growth of the muscle to be higher which is going to result in the depth of the line increasing over time.

There is some additional science that supports the need for more adduction of the arm across the body if you want to grow a bigger chest. The existence of something called non-spanning fibers. When these fibers are engaged by the contraction of the fully spanning fibers that run from your arm to your sternum, they too can participate in the contraction and experience the same growth that typical fibers do. 

If you don’t engage them by ever bringing your arm far enough across your body to do so, they will never experience the growth stimulation possible and the overall size of the chest will remain smaller. Remember, if you want to get your middle chest to look more defined you have to be sure you are growing the muscle as much as possible. Maximum stimulation of the muscle across the chest exercises you perform is the goal always.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20MIDDLE%20Chest%20Solution%20(GET%20DEFINED%20PECS!).mp4?alt=media&token=564e0722-6674-4584-89ef-f88b42682835" ],
      "subtitle" : "By Google",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailchest22.jpg?alt=media&token=09c2e798-839d-4957-82a1-bea331c9a3a9",
      "title" : "The MIDDLE Chest Solution (GET DEFINED PECS!)"
    }, {
      "description" : "The lower chest line is something that many guys struggle to develop.  In this video, I’m going to show you how to get defined lower pecs by hitting the bottom most portion of your pec muscles with the right exercise selection.  In fact, I’m breaking out 8 exercises that will help you to hit your lower chest more effectively than ever before.

I start by showing you the classic decline bench press and explain why this exercise is a little better at developing your lower pecs than the flat or incline variation.  It all has to do with the position of your arms in relation to your torso when doing the movement.  You will see that when you sit up after finishing a set of decline bench press that your arms are not angled perpendicular to your body but downward.  

The anatomy of the chest explains why this is the preferred angle for attacking the bottom of your chest.  The pectoralis major is broken up into two main sections (the clavicular or upper and the sternal or lower).  In the sternal area of your chest however you have an additional head of the pecs called the abdominal head.  This is the lowermost portion of the pecs and angle from bottom to top heading towards your humerus.

If you follow the fibers and train in the same plane as these lower chest fibers then you will more effectively allow them to be activated and recruited during your chest exercises.  Knowing this, we can select chest movements that are better able to hit this lower chest than what you might currently be doing.  If your chest workouts consist of simply dips or decline bench press to hit your lower pecs or worse, you avoid these exercises all together, then you are going to benefit from trying some of these out.

First we revisit the classic dip exercise (which is again a great way to hit the lower chest) and make it even better by including a plus push at the end of every rep.  This extra scapular protraction allows you to hit the serratus anterior muscle as well, which ties in perfectly with the function of the chest and helps to stablize your shoulder during the exercise as well.

Next we can do a straight bar dip to hit the bottom pecs.  Because you have to angle your entire body more forward during this exercise to keep yourself balanced over the bar, you automatically wind up placing your arms in the proper position to effectively target the lower chest more.  The additional internal rotation of the arms during the exercise helps to get a better contraction on the chest at the top of every rep.

From here, you can get more adduction into the exercises you are doing for your lower chest by performing either the D2 flexion pattern with a band or the kneeling x crossovers.  Both of these allow you to train with either one arm at a time or both and help you to build a better mind muscle connection with the working muscles.  This carries over to help you get better muscle development and a defined lower chest in the long run.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20LOWER%20Chest%20Solution%20(GET%20DEFINED%20PECS!).mp4?alt=media&token=e2db21bd-4b6b-4a77-8edd-60cfe6bb2097" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailchest33.jpg?alt=media&token=e0f690f0-7bbf-4aa4-9b60-004ee7c1d69f",
      "title" : "The LOWER Chest Solution (GET DEFINED PECS!)"
    }, {
      "description" : "The upper chest is an area that a lot of guys struggle to develop.  In this video, I’m going to show you how to get fuller pecs by putting the science back in 8 exercises for the upper chest.  If you adhere to the principle of following the fibers, you will see how it is possible to add muscle to the upper portion of your chest much more quickly.

It starts with a bit of anatomy of the upper pecs.  This area of the chest has attachments at the clavicle and the humerus or upper arm bone.  The most important point however is that the direction of the fibers in this area run from up and in to down and out.  In other words, when your arm is placed at your side and away from your body, the upper chest is responsible for bringing it up and across your body at an angle.

If you adhere to the direction of these fibers and mimic the movement in your chest exercises, you will more effectively hit the upper chest.  The fact that the upper pecs have a separate nerve innervation than the rest of the pec major allows you to neurologically target the area even more with a better focus and contraction.  

We all know that the incline bench press is an exercise that targets the upper chest.  That said, there are limitations to this movement that prevent it from being the best move to hit this area.  If you can incorporate adduction into the movement as well, then you would be able to get a better chest contraction.  

The most important consideration for determining the effectiveness of the other upper chest exercise options is the orientation of the arms during the movement.  Are the arms moving up and in and if so, then you are likely hitting the upper fibers of the chest better.  Here I show you a few bodyweight chest exercises like the upper chest dip and the pushaway pushups.  Each of these are performed with the arms placed in front of the body to effectively hit the upper chest more.

The one armed dumbbell shrug is an exercise that shortens the moment arm of the pecs and allows you to use heavier weights to hit the upper chest.  You can opt instead for lighter weights and a greater range of motion by doing the landmine rainbows.  Either way, you will see that the direction of the arm is the same.  Any time you want to target the upper pecs more than the lower you have to bring the arms from the low and away position to a up and in placement.
",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20UPPER%20Chest%20Solution%20(GET%20FULLER%20PECS!).mp4?alt=media&token=d1161d03-667f-457a-bfd2-d7b4c3d30987" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailchest44.jpg?alt=media&token=d75ec212-2e9d-45d2-95fa-40c6db978a31",
      "title" : "The UPPER Chest Solution (GET FULLER PECS!)"
    }, {
      "description" : "The perfect back workout should consist of exercises for not just the lats and traps but other important muscles of the back as well.  That said, even that doesn’t make the back workout complete.  In order to round out your back with a well rounded workout you need to fill in the gaps of what is lacking on those popular back exercises and put science back in your training.  That is what we do in this video.

The problem with lat focused training isn’t just that it trains simply a fraction of what the back muscles are capable of but also that many people choose repetitive exercises that work the back in the same plane.  For instance, if you look at the pullup and lat pulldown you will see two major vertical pulling exercises that while not bad to perform in the same back workout, overlook the importance of horizontal pulling if nothing else is done.

It goes beyond this however.  Even when you perform the pullup, many will look at it as a high rep bodyweight exercise only.  They overlook how powerful the movement can be when loaded up with additional weight as in a weighted chin up.  This can become a tremendous compound exercise option and one that is capable of building a lot of back strength, size and overall gains.  Additionally, getting locked in on one grip during this exercise is costing you the chance to work other areas of the back such as the teres major (which in and of itself occupies a large amount of mass above the lats) and therefore limiting the gains you will see from your workout.

Instead, you will want to be sure to mix up chins and pullups along with a foundational strength exercise for the back like the deadlift to start your workout off right.  The deadlift has the ability to work many of the areas of the back all in one shot.  The traps, lats, and lower back all get a heavy dose of overload on this powerhouse of a back exercise.  If you load it heavy enough and refuse to sacrifice your form, this can be an enormous benefit to your overall back development.

We also have an opportunity to introduce some straight arm pushdowns with each warmup set of deadlifts.  This helps to ingrain one of the most important movement patterns you will need to not only perform the deadlift but all next level back exercises.  

As you make your way through the workout however you also don’t want to miss the chance to train explosively.  When you train like an athlete you always want to speed up what you slow down with your heavier weight training. The barbell dead row is a perfect example of this.  Perform this powerful back exercise as a follow up to the deadlift and you will find that even a heavier weight seems lighter and more able to be accelerated.

No perfect back workout would be complete without some additional focused tension towards the lats.  This allows you to develop that mind muscle connection that is important for maximizing hypertrophy of the back.  Choose between one of the two exercises listed and only do one of them.  Just focus on really squeezing each rep and taking the lats through their full range of motion for optimum effect.

Finally, a perfect back workout will not forget the importance of corrective exercises for the back.  Here we want to be sure we work both the lumbar erectors and rotator cuff.  We can do both in one move using the Hyper Y/W combo shown in the video.  You will not need to use heavy weights to do this.  Light weights will still light you up in exactly the way you need to be for best effect.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20PERFECT%20Back%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=a8ba4c1f-fe40-4a5c-bf35-7ed3f7a94355" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailback00.jpg?alt=media&token=916a4973-7476-4621-8a25-68a1020373d9",
      "title" : "The PERFECT Back Workout (Sets and Reps Included)"
    },{
      "description" : "If you have been looking for a full back workout to gain muscle and build a bigger wider back, especially if you are a skinny guy, then this is the video for you. Jesse from ATHLEAN-X is back to show you the exact back workout he used to develop thicker wider lats and traps from the top down. There is no doubt that the changes are noticeable and every part of the back are developing as a result of the hard work being put in.

To start, Jesse picks a staple compound lift to form the centerpiece of his back workout. For him, this is the deadlift. Not only does this movement have tremendous carryover to other elements of his training and function but it did a great job in helping him to overcome some of the postural deficits that were causing him significant problems early on in his training.

From here, he moves onto a horizontal rowing movement. There is a choice between two back exercises at this point. The first is the barbell row to gain muscle. This classic movement is done to help thicken the back from front to back by building more depth in the interior muscles of the back (namely the rhomboids, paraspinals and even the lats). The movement is done from the more traditional hang position as opposed to from the floor in a pendlay variation of the exercise.

If the barbell row is not chosen then the alternative option is the seated row. This is typically done with a cable machine but of course can be done with bands if you are training at home. The key to this is the hand position in relation to the torso. Rather than holding the hands at the level of the navel, it is helpful to set the hands at a position lower. This demands that you reach forward and down, which will create a great stretch on the lats and prime there for a stronger contraction on every rep due to the stretch reflex created from this position. 

Moving on, the next focus is a vertical pulling movement. Here the back exercise options are either the classic pullup (this can be done weighted or unweighted) or the lat pulldown. Obviously, the pull-up is going to be more accessible of an option to those training at home but either will suffice. If able to use the pulldown machine, make sure to experiment with the rocking variation shown. This allows the elbow to not only have an easier time getting into adduction (driven into the side of the body) but also behind the body into extension. The combination of these increases in range of motion allow for a better recruitment of the lats on this key pulling movement.

This is the point when many back workouts would end. That said, given Jesse’s history of chronic postural issues, there are three additional exercises that are done every time he trains his back. The first is one that is actually done at the end of every workout he does (along with facepulls not shown here), and that is the weighted carry.

There is no need to do lots of volume here. The key to gain muscles is consistency, and the accrued volume over time that makes the biggest impact. A few laps with dumbbells at the end of the workout is enough to stimulate the traps additional to the work they are already doing on the heavier deadlifts and rows.

Next up is the plate trap raise. This works on the all important lower traps. If you fail to acknowledge the traps as two separate areas you will likely overlook the benefit gained from working this area of the muscle with a different exercise. You will gain much more stability with overhead movements when the lower traps are strong and developed. This back exercise is one of the best ways to achieve that.

Finally, the hyper row is an exercise that helps to target the lower back. The addition of the dumbbell row to the movement will have some direct impact on the rear delts but the act of rowing is actually done to prolong the time that you must stay in the extended position and therefore allows for better recruitment of the lumbar paraspinals on every rep. Don’t focus on the number of reps here but rather the quality of the rep if you want to make the most of this back exercise.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FBack%20Workout%20to%20Gain%20Muscle%20(SKINNY%20GUYS!).mp4?alt=media&token=4033c306-6853-4636-95b9-89e0da64d9e4" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailback11.jpg?alt=media&token=1faf975a-131b-4916-a418-22bc4898c21f",
      "title" : "Back Workout to Gain Muscle "
    }, {
      "description" : "The fastest way to get a wider v-taper back is to focus your attention on the muscles in the back that contribute the most to width. In this video, I’m going to show you the best back exercises you can do to build up your lats, teres major and teres minor in order to get the widest back possible. We are breaking out the science here to get you the best results you can from your workouts.

First, it always helps to look a bit at the anatomy of the muscles you are trying to develop. In the case of back width, the three that have the greatest impact are the latissimus dorsi, teres major and teres minor. Odds are, you may have been focusing a pretty good amount of attention at developing your lats but have you ever stopped to think what you should be doing for those other two muscles.

The truth is, if you want to build a great v-taper back then you need to look at the best ways to train all of these muscles. The good news is, all it takes a few small tweaks to exercises you may already be doing to shift the focus of the workload onto either of these three muscles. When you see just how easy this is to do you won’t feel overwhelmed at all and will be excited to go try some of these small exercise tweaks right away.

First, let’s talk about the lat pulldown machine. Actually, this machine is a little misnamed since you can preferentially train more than just the lats here. That said, if you want to hit the lats the most you want to be sure to perform an underhand pulldown or a rocking pulldown. The key here is that you want to get the elbows out in front of your body as far as possible to place a greater stretch on the lats. Also, as you pull down, each of these exercises will give you the best chance to keep your arm tightly adducted to your side to maximally activate the lats.

If you wanted to shift the focus to the teres major all you have to do is take a much wider, overhand grip on the bar and do a pulldown. This takes away some of the lat favorability of the exercise and shifts the load more to the muscle you are trying to develop. 

By attaching a rope to the pulldown machine you can incorporate external rotation at the shoulder and do a better job of recruiting the teres minor (a rotator cuff muscle) to perform the exercise. The name of this exercise is the face pulldown, and it’s a fantastic exercise for building up the complete va taper of your back.

Keep in mind, all of these variations can help you develop a wider back and all of them can be performed on a pullup bar if you don’t have access to a lat pulldown machine.

Additionally, you can target the teres major with a landmine setup as shown in the video. Once again, remember to keep your elbow out wide away from your torso and position yourself perpendicular to the landmine olympic bar setup. Want more lats? Just step to the side of the bar and pull it up parallel and tight to your body and you’ll shift the focus instantly.

Finally, the one arm hi pulley row is a great way to place the lats on tremendous stretch and take them through their full range of motion. This may be one of my favorite ways to build a wider back. Shift the attachment to a rope handle and perform the tried and true face pulls and you’ve just added another exercise to your teres minor building arsenal. 

The key to building a wider back is to understand which muscles you want to focus your efforts on and which back exercises to the best job at getting the job done. Here I’ve just shown you quite a few options to do that.  If you’re looking for a complete program that will help you to put the science back in all of your workouts, be sure to head to the link below and check out the athlean-x training system best suited to your current goals.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FHow%20to%20Get%20a%20WIDER%20Back%20(V-TAPER!).mp4?alt=media&token=23ee5d22-06d1-4464-b498-8d78e3a63cfd" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2Fthumbnailback2.jpg?alt=media&token=a8e52d62-ed41-4ce1-98c5-94ddf4a2926b",
      "title" : "How to Get a WIDER Back "
    }, {
      "description" : "The key to any arm workout is intensity.  There is no better way to ensure the intensity of a workout than to take the normal volume you would do and condense it into a much shorter period of time.  In this video, I show you an arm workout with just 4 biceps and triceps exercises that you can complete in 8 minutes or less that will spark all kinds of arm gains.

The setup for the workout is easy.  All you need is a single pair of dumbbells, a bench that you can adjust to an incline and a pullup bar.  You want to start with just two arm exercises, the hands out incline curl for your biceps and the incline dumbbell triceps extensions for the muscles on the other side of your arm.  Choose a weight that you can perform 12 reps to failure on in your weaker of the two exercises.  In this case it is the triceps extension for me.

Start by performing a set of the hands out incline curls to failure.  As soon as you cannot complete another rep lift the dumbbells up overhead and go right into your overhead triceps extensions.  Here again, you will want to go until you cannot perform another quality rep and your triceps are fatigued.  Back again to the incline curl where you want to perform as many reps as you can to failure.  You keep bouncing back and forth between these two arm exercises until you can’t complete any more meaningful reps.

This will happen rather fast because as you fatigue in one arm muscle group you will have a shorter rest time before having to complete reps for the other muscle.  By virtue of this short rest time you will eventually fail out in both exercises.  At this point however, you are only half way through your workout.  This occurred in just 4 minutes for me.

Move on immediately to the next pair of exercises in this 8 minute arm workout.  Here you want to do a bicep chin curl hold.  The goal here is to squeeze your biceps as hard as you can to maintain your position on the bar.  Even as you fatigue you want to keep trying to contract your arms as hard as you can and fight the drop.  Once you cannot hold it anymore, go right to the floor and crank out reps of the cobra pushup.

You want to concentrate on squeezing the triceps hard at the top of every pushup.  The benefit to this triceps exercise over others is that you finish with your arm in extension behind your body so you are actively contracting the long head of the triceps as well.  Rep out and get back up on the bar again.  Keep alternating these biceps and triceps exercises until you once again cannot perform any more meaningful reps of either exercise.
",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2F8%20Minute%20Arm%20Workout%20(SHOCK%20YOUR%20ARMS!).mp4?alt=media&token=7b8f8ea7-dff0-44ed-ac8b-be746b585fda" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailarm00.jpg?alt=media&token=ae471fb4-38e0-4670-be4c-c5e35e68255c",
      "title" : "8 Minute Arm Workout"
    }, {
      "description" : "The perfect biceps workout should consist of exercises that not only hit the long and short head but also the brachialis, a totally separate muscle. In addition, it must put the biceps through its full range of motion and utilize both the flexion of the elbow and the supination of the hand. That said, even that won’t complete your biceps workout! In order to round out your biceps you need to also include techniques that create unique stresses on the muscle giving it no choice but respond. That is what we do in this video.

If you look at the main exercises that people do in their biceps workouts you will see a lot of curls. After all, a major function of the biceps is to flex the elbow. 

This is a problem when it comes to complete biceps development your biceps likely get plenty of activation during your back workout so in order to take your development to another level you need to include unique methods of stimulation. Just because you are going through a full range of motion on the exercises that you are doing and performing the major roles of the muscle 9elbow flexion and hand supination) it does not mean that you are giving the muscle sufficient stimulus to force growth. We all know guys who can do tons of pull ups and heavy rows but don’t have the greatest bicep development. 

The solution to this problem is to not forego the popular mass building exercises, those are still the foundation of our training, but we also need to add specialization exercises and techniques. With that said, here what the perfect biceps workout would look like:

Cheat Curls - To Failure immediately into
Barbell Drag Curl - To Failure

Perform for 3 Sets

Weighted Chins -  To Failure immediately into
Pulsed Contraction Chin Curls - To Failure

Perform for 3 Sets

Incline Dumbbell Curls - 3 sets to failure (Utilize the stretch reflex of the triceps technique)

Dumbbell Curl Trifecta -  2 sets of 8 on each arm for each exercise
 – Cross supination (Emphasizes the long head of the biceps)
 – Cross pronation (Emphasizes the brachialis )
 – No Money curls (Emphasizes the short head of the biceps)

When you put this together in as I’m suggesting here, you not only now hit the biceps through it’s full range of motion but you hit every area of the biceps as well and in a fashion they’re not likely grown accustom to. Advanced techniques allows for a more intense sets which are obviously more taxing pair that with the difficult compound lifts and you have an excellent workout.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20PERFECT%20Biceps%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=99edc726-a077-499c-8f4a-03cd5fbc6db5" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailarm11.jpg?alt=media&token=43656a6d-de36-4888-83f5-1b2a87710b52",
      "title" : "The PERFECT Biceps Workout"
    }, 
{
      "description" : "The perfect shoulder workout should consist of exercises for your front delts, middle delts and rear delts (not necessarily in that order!). That said, even that doesn’t make the shoulder workout complete.  In order to round out your shoulders with a well rounded workout you need to fill in the gaps of what is lacking on those popular shoulder exercises.  That is what we do in this video.

If you look at the four main exercises that people do in their shoulders workout you will see barbell or dumbbell overhead press, side lateral raises, front delt raises and maybe even dips.  Take a close look into each of these classic movements and you will see one thing in common.  That is, each of these exercises is lacking either a stretch position of the shoulder or doesn’t take the muscle through it’s full available range of motion.

This is a problem when it comes to developing a complete set of impressive shoulders.  Just because you are going through a full range of motion on the exercises that you are doing it does not mean that you are taking a muscle through its full range of motion.  For instance, all shoulder exercises are performed by changing the angle of the arm at the shoulder.  Because the shoulder is a three dimensional ball and socket joint, you have a great deal of motion available to you on your shoulder exercises.

That said, we often overlook the fact that the shoulder joint is not just this ball and socket.  Because the socket is technically the shoulder blade, you have to consider all of the other muscles that are connected to these bones that then play an important role in shoulder training.  Not just that, but hypertophy should never be the only goal of your shoulder workouts.  In order to be complete like an athlete you are going to have to incorporate some movements that train the explosiveness of the entire shoulder girdle and let you train all of these muscles together.

The solution to this problem is to not forego the popular mass building shoulder exercises or even the lighter ones geared at mass but add to them, and overlook no element of complete training.  Here is how to construct the perfect shoulder workout with that in mind.

Warmup with Overhead Banded Press - 2 sets of 15 with 3 second holds each rep.

OHP or Handstand pushups - 4 sets of 12,8,6,6 reps
Finish with one set of dumbbell and band overhead presses for neuromuscular re-education x 15 reps

Delt Stretch Tri-Set (21’s) - 2-3 sets of 7 reps in each direction for rear, middle and front delts
Make sure you perform these in the order of rear to front to account for fatigue.

DB Cheat Laterals - 3 sets to failure on each arm
Immediately into a DB Push Press to failure on each arm

Cable or Banded Face Pulls - 3 sets of 15
Perform these with a mindset of 15 sets of 1 to ensure highest quality of every rep.

When you put this together in the format as I’m suggesting here, you not only now hit the shoulders through their full range of motion but you hit every area of the shoulders as well.  The drop down allows for the lesser intense exercise to be more taxing since it was just preceded by a more difficult compound lift.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FThe%20PERFECT%20Shoulder%20Workout%20(Sets%20and%20Reps%20Included).mp4?alt=media&token=b840f252-815d-41d7-a775-806a699f84e7" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailshoulder00.jpg?alt=media&token=e2ef244c-f0bb-4d29-95a6-7777eda79d89",
      "title" : "The PERFECT Shoulder Workout"
    }, {
      "description" : "If you want to learn how to get bigger shoulders fast then you’ve come to the right place. In this video, you will see how to build big shoulders by doing the opposite of what you likely have been doing up to now. It is going to require that you use slightly heavier weights and focus more on the quality of the contractions of the shoulder muscles on every rep rather than only pressing heavy weights and overdeveloping patterns that are already holding back your gains.

The lack of shoulder growth can be blamed on two things, and it isn’t your mom and dad.  It is the over reliance on just heavy and light dumbbells for shoulders and not training the rear delt enough.

Let’s start with the rear delts, or the lack of training them to be exact. Extension of the shoulder is actually one of the most overlooked components of a fully trained shoulder muscle. The rear head of the shoulders has the ability to extend the shoulder and can handle fairly heavy weight in the process.  The issue however is that you don’t want to just extend the shoulder but also incorporate abduction to hit the middle delt head as well.

The best way to do this is with something called a hip hugger. This starts with dragging the dumbbells up your side as you move your shoulders back behind your body. The elbows then drift away from the sides as you come up to light up the middle delt as well. The key to performing this correctly is making sure that you cannot see your elbows in front of your body if you look to the side. They should be out of view the entire time in order to prevent turning this into a modified upright row.

To make sure you grow bigger shoulders fast you are going to need to increase the weight you are used to a little bit on this shoulder exercise. The rear delts with help of the middle delts can handle slightly heavier loads and should therefore be pushed by using them. You’ll find that you can likely lift more than you can on a lateral raise but less than what you would use on an overhead dumbbell press.

If you get this right, the shoulders and rear delts will be doing all of the lifting. No momentum. What this does is it also keeps the dumbbells very close to the body. While this is not a drag, the closeness of the dumbbells to the body are going to allow you to use slightly heavier weights. Specifically this is going to hit the middle and rear heads of the delts a lot better. When you are struggling to build big shoulders fast, the rear head is often last to grow. 

The front delt doesn’t have to go unworked however.

The second thing you can do is hit the front delts immediately following the conclusion of a set of the hip huggers by doing something called the scoop press. Here, the weights you used on the first shoulder exercise will be perfect to crank out a few reps of the overhead press variation. Lock the elbows into a ninety degree position and drive the upward thrust of the arms with the front deltoids alone.

This works as the perfect drop set and compliments the work already done on the middle and rear delt exercise to make sure you leave no head of the delts unworked.

When you learn how to train the rear delts effectively you will likely fall in love with working them. Many people skip them all together in their shoulder workouts for mass because they just can’t seem to get the exercises to work for them. Now that you can feel them, you can start regularly incorporating these into your workout for bigger shoulders.

If you want to build bigger shoulders fast you sometimes have to be willing to take a step backwards to take giant steps forward. 

These two exercises are something you can include into your very next shoulder workout that are going to start to deliver big results to your shoulder training and growth.",
      "sources" : [ "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBody%2FHow%20to%20Get%20Bigger%20Shoulders%20Fast%20(JUST%20DO%20THIS!).mp4?alt=media&token=705e0b09-e4d1-47ce-a49f-d1c3521ea993" ],
      "subtitle" : "By Athlean-X",
      "thumb" : "https://firebasestorage.googleapis.com/v0/b/licenta-gym.appspot.com/o/Fitness%2FUpperBodyPremium%2Fthumbnailshoulder11.jpg?alt=media&token=a188c9b1-f262-4a5f-9487-0a0c2fd8cc19",
      "title" : "How to Get Bigger Shoulders Fast"
    } ]
  } ]
}
